{"data":{"allMarkdownRemark":{"edges":[{"node":{"html":"<p>Over the past few days We've been hard at work not only preparing the site for launch, but also working on my elevator pitch for what Habichat will be. Long-winded descriptions and fancy buzz-words aside, I realized that the competetors we face as a start-up are fundimentally different in one key manner - they're not Canadian. In fact, there are no Canadian social media companies, and that's a bigger problem than you may realize.</p>\n<p>If you haven't heard of the GDPR (General Data Protection Regulation) then you may not be someone who has fears about data privacy and ownership. But whether you are informed or not about it's existance, the GDPR is becoming commonplace around the globe. The European Union was the first to pass it into law, and since then many more governments around the world are instilling it's rules to protect the private information of it's citizens. The GDPR ensures transparency and modality, the right to be forgotten, the right to reject automated decisions, anonymisation, and encryption. The Québec government has already began working towards ratifying the GDPR within the provice and I'm sure the rest of Canada will soon follow.</p>\n<p>It's important that Habichat is Canadian because America is slow to adopt these policies, information is openly shared with government agencies and even if you are a Canadian citizen, most of your information is sent to the United States to be stored and processed however these companies see fit.</p>\n<p>Habichat, on the other hand, stores your data only in Canadian data centers. We're forward thinking about privacy, and most importantly we believe that Canadian's should have access to a world class social media site without surrendering what we share with foreign governments. The dream is there, it's time for us to make it a reality.</p>","frontmatter":{"date":"May 28, 2020","lang":"en","slug":"canadas-social-network","title":"Canada's Social Network","author":"Charles Hay"}}},{"node":{"html":"<p>I found an interesting whitepaper today explaining the functionality of a peer to peer encrypted messaging service built into the chrome browser; The functionality leverages the RTCDataChannel and RTCPeerConnection apis. What I liked about it is that other than needing a server to setup the IP addresses of each client - the messaging is done exclusively from browser to browser. Of course the limitations of this technology are that if you don't have the webpage opened at the time you aren't able to subscribe to the sent messages and read them - also they will dissapear when you close the window. I wonder if using a web worker in the background there would be a way to persist the information even when the user isn't active? pretty exciting stuff.</p>\n<p>Today I reorganized our Google Cloud infrastructure to exist in Montreal datacenters (because I want to keep all information within Canada). This means that I had to relegate the cloud functions to the nether realm. I don't think this should be a problem and will help keep pricing down as I will need to worry about one less Google service being billed. How does a developer even protect themselves from someone spamming a cloud function? I know I can protect the response with a token validating middleware, but the function is still invoked even if the credentials fail... whats to stop a malicious party from just spamming the endpoint? ... maybe getting rid of those things was a good call for more than one reason.</p>","frontmatter":{"date":"May 26, 2020","lang":"en","slug":"keeping-data-private","title":"Keeping Data Private","author":"Charles Hay"}}},{"node":{"html":"<p>As someone who's moved 5 times in the last 10 years, I've gotten used to the feeling of settling in to a new city as a complete stranger. I've learned many things from making new friends over and over again and as a naturally social person I know that having a community of important people around me increases my quality of life tenfold. If there's one thing I've realized about starting over in a new city it's that geography plays an important role in the relationships we build. Having Important people near us matters and this is what social media gets so wrong.</p>\n<p>So I decided to do something about it - it just so happens that I'm a software developer who's worked on many large applications at the CBC, rTraction and Telus Digital. I recently took a sabatical from work and I decided to strap myself down and start sketching out wireframes, modelling databases, and enrolling myself in Y Combinator's Start-up school. Much like any good idea, the first step to success is to test the viability of my idea - so I created this website and this blog as a way to communicate what I'm trying to do with the world. </p>\n<p>I want habichat to connect communities together across Canada but first, I need to test things on a smaller scale. So I'm asking residents of Montreal and specifically Ville Émard to help me gain some valuable market research. If you're someone who lives in the area, you are a digital connector, and you'd like to help collaborate together - please join our <a href=\"http://slack.habi.chat/\">Slack Channel</a>\nor shoot over an <a href=\"mailto:hello@habi.chat\">Email</a>. I can't wait to see what amazing things we come up with. </p>","frontmatter":{"date":"May 10, 2020","lang":"en","slug":"the-habichat-manifesto","title":"The habichat Manifesto","author":"Charles Hay"}}}]}}}